export default {
  website: {
    title: "Селим Атабаллыев",
    subtitle: "Разработчик Full Stack",
    description: "Преобразование идей в интуитивные веб и мобильные решения",
  },
  meta: {
    title:
      "Селим Атабаллыев | Экспертные веб-решения и разработка индивидуального программного обеспечения",
    description:
      "Ищете первоклассного Full Stack разработчика? Я опытный разработчик, предлагающий экспертные веб-решения и услуги по индивидуальной разработке программного обеспечения для того, чтобы поднять ваши проекты на новый уровень. Свяжитесь со мной сегодня!",
    author: "Селим Атабаллыев",
    keywords:
      "Селим Атабаллыев, Создание веб-сайта, Full Stack разработчик, Гибкая разработка, Развертывание программного обеспечения, Безопасность веба, Совместимость с разными браузерами, Пользовательский опыт, Архитектура программного обеспечения, Производительность веба, Техническая документация, Прототипирование программного обеспечения, Проектирование баз данных, Версионирование программного обеспечения, Отладка программного обеспечения, Оптимизация мобильных приложений, Тестирование UI/UX, Доступность веба, Интеграция бэкэнда, Фреймворки фронтенда, Дизайн с учетом мобильных устройств, Документация API, Техническое обслуживание программного обеспечения, Обзор кода, Обновление программного обеспечения, Оптимизация веб-сайтов, Адаптивные изображения, Обработка ошибок, Автоматизированное тестирование, Фреймворки программного обеспечения, Развертывание программного обеспечения, Веб-хостинг, Масштабирование приложений, Миграция веб-сайтов, Аутентификация пользователей, Управление веб-контентом, Индивидуальная настройка программного обеспечения, Интеграция систем управления содержимым, Прототипирование веб-приложений, Мониторинг веб-сайтов, Адаптивные шаблоны электронной почты, Функциональность поиска, Взаимодействие с клиентами, Устранение неполадок программного обеспечения, Соответствие веб-стандартам, Поддержка программного обеспечения, Постоянное совершенствование, Качество кода, Многократное использование кода, Обновление программного обеспечения, Оптимизация кода, Управление временем, Планирование проектов, Сотрудничество, Общение с клиентами, Инновации, Тенденции в веб-разработке, Лучшие практики отрасли, Решение проблем, Креативные решения, Техническая экспертиза, Веб-сайты высокой производительности, Интерактивный веб-дизайн.",
  },
  about: "Обо мне",
  experiences: "Опыт",
  projects: "Проекты",
  lightMode: "Светлый режим",
  darkMode: "Темный режим",
  github: "Гитхаб",
  preview: "Просмотр",
  contactMeNow: "Свяжитесь со мной сейчас",
  footerContent: `<p class="text-sm md:py-15 py-10 dark:text-gray-400 text-gray-800">
   Разработан с использованием <span class="highlight"> Nuxt.js</span> и <span class="highlight" >Tailwind CSS</span>, развернут на <span class="highlight">Vercel</span>. Весь текст отображается шрифтом <span class="highlight">Inter</span>.
</p>
`,
  aboutContent: `
    <p>
      Я 
      <span class="highlight">разработчик full stack</span>, владеющим широким спектром передовых технологий, таких как <span class="highlight">HTML, CSS, Sass, Javascript, Vite.js, Vue.js, Nuxt.js, React Native, DivKit, Node.js, Nest.js, MongoDB, PostgreSQL, pm2, nginx, git</span>.
     </p>
     <p>
       С акцентом на разработке
      <span class="highlight">frontend development</span>, я создаю отзывчивые и динамичные веб-приложения с использованием
      <span class="highlight">Vue.js</span>,
      <span class="highlight">Nuxt.js</span>,
      <span class="highlight">TailwindCSS</span>,
      <span class="highlight">Primevue</span>, эффективный backend на
      <span class="highlight">Node.js</span> и
      <span class="highlight">Nest.js</span>. Я разрабатываю <span class="highlight">масштабируемые и эффективные приложения</span>, повышая основные показатели предприятий до 500%.
    </p>
    
    <p><span class="highlight">Я занимаюсь настройкой серверов и развертыванием веб-приложений </span> с использованием облачных решений и технологий, таких как <span class="highlight">NGINX</span> и <span class="highlight">pm2</span>. 
    </p>
    
    <p>
    Мой репертуар выходит за пределы веб-мира, так как я могу разрабатывать <span class="highlight">нативные мобильные приложения</span> с использованием <span class="highlight">React Native</span> и фреймворка под названием <span class="highlight">DivKit</span>
    </p>
`,
  projectItems: {
    legoGen: {
      name: "Генератор персонажей Лего",
      description:
        "Представляю вам моё приложение, которое позволяет вам создавать уникальный аватар, настраивая различные элементы, такие как прически, брови, черты лица, одежда и многое другое! Мой удобный пользовательский интерфейс делает процесс создания аватара простым для всех и займет всего несколько минут (создан в течении сутки в рамках тестового задания)",
    },
    pokemon: {
      name: "Сайт покемонов (React)",
      description:
        "Сайт-каталог с покемонами (Public Pokemon API), написанный на React + Redux",
    },
    fantagolia: {
      name: "Развлекательный веб-сайт (Nuxt и концепция дизайна)",
      description:
        "Поднимите свои веб-проекты с этим дизайном развлекательного веб-сайта на HTML, CSS и JavaScript. Адаптивный, насыщенный функциями и плавно интерактивный 🚀🌐",
    },
  },
  experienceItems: {
    ideal: {
      position: "Разработчик Full Stack",
      subtitle: "Веб-разработка",
      place: "IDE-AL Hyzmat",
      description:
        "Как полноценный веб-разработчик в IDE-AL, я играл решающую роль в разработке и поддержке веб-приложений, обычно используя Nuxt.js и Node.js. На протяжении всего своего пребывания в должности я активно сотрудничал с кросс-функциональными командами, преобразовывая бизнес-требования в функциональные и удобные веб-приложения и увеличивая продажи наших клиентов до 200% каждый. Я внес свой вклад в оптимизацию производительности приложений, обеспечив бесперебойную работу пользователей. Мой опыт работы с этим разнообразным набором технологий позволил мне решать различные задачи, адаптироваться к новым технологиям и вовремя реализовывать успешные проекты. Это был мой первый коммерческий опыт.",
    },
    geekspace: {
      position: "Разработчик фронтенд",
      subtitle: "Веб-разработка",
      place: "Geek Space",
      description:
        "Как фронтенд-разработчик в Geek Space, я разрабатывал высоконагруженные веб-приложения, предоставляющие список услуг, таких как аналитика, CRM (с несколькими интеграциями) и веб-сайты для клиентов. Я принимал огромное участие в разработке основного сервиса, CRM, что позволило обслуживать всех наших клиентов в одном месте. Нанял и предоставил наставничество более +25 разработчиков",
    },
    freelance: {
      position: "Разработчик Full Stack",
      subtitle: "Веб и мобильная разработка",
      place: "Фриланс",
      description:
        "Как full stack фрилансер, работающий во фрилансе, я разрабатывал масштабируемые мобильные и веб-приложения с командами от 5 до 35 человек. В основном я работал со стартапами, чтобы обеспечить им наиболее эффективный старт с самого начала, предоставляя бизнес-решения, такие как мобильные приложения, веб-приложения, такие сервисы, как CRM (в основном), аналитика и т.д.",
    },
  },
  now: "Сейчас",
  CV: "Резюме",
  seeCV: "Посмотреть резюме",
};
